#+OPTIONS: \n:t
#+TITLE: Auto Watering
#+SUBTITLE: Individual Plant Pot
#+LANGUAGE: en
#+AUTHOR: Lesh
#+DATE: [2024-12-02 Mon]
#+LAST_MODIFIED: [2024-12-20 Fri]
#+VERSION: v0.1 alpha


** Schematic

#+BEGIN_SRC diagon :mode GraphDAG :exports results
Power -> Moisture Sensor
Water -> Nozzle
Nozzle -> Plant
Moisture Sensor -> Plant
Plant -> Drain Water
#+END_SRC

#+RESULTS:
#+begin_example
┌─────┐┌───────────┐     
│Power││Water      │     
└┬────┘└──────────┬┘     
┌▽──────────────┐┌▽─────┐
│Moisture Sensor││Nozzle│
└┬──────────────┘└┬─────┘
┌▽────────────────▽┐     
│Plant             │     
└┬─────────────────┘     
┌▽──────────┐            
│Drain Water│            
└───────────┘            

#+end_example

** Elements
#+BEGIN_SRC diagon :mode GraphDAG :exports results
Soil Filter -> In-pot element
In-pot element -> Bottom convex element
Bottom convex element -> 12mm push in fitting
#+END_SRC

#+RESULTS:
#+begin_example
┌───────────┐          
│Soil Filter│          
└┬──────────┘          
┌▽─────────────┐       
│In-pot element│       
└┬─────────────┘       
┌▽────────────────────┐
│Bottom convex element│
└┬────────────────────┘
┌▽───────────────────┐ 
│12mm push in fitting│ 
└────────────────────┘ 

#+end_example


** Schematic

#+BEGIN_SRC diagon :mode GraphDAG :exports results
unpressurized_drain -> container -> pump -> pressurized_drain
sensor -> controller -> pump
power -> controller
container -> sensor
#+END_SRC

#+RESULTS:
#+begin_example
┌───────────────────┐┌─────┐
│unpressurized_drain││power│
└┬──────────────────┘└┬────┘
┌▽────────┐           │     
│container│           │     
└┬─┬──────┘           │     
 │┌▽─────┐            │     
 ││sensor│            │     
 │└┬─────┘            │     
 │┌▽──────────────────▽┐    
 ││controller          │    
 │└┬───────────────────┘    
┌▽─▽─┐                      
│pump│                      
└┬───┘                      
┌▽────────────────┐         
│pressurized_drain│         
└─────────────────┘         

#+end_example


#+BEGIN_SRC diagon :mode GraphDAG :exports none
pot_drain -> container -> pump -> main_drain
container -> sensor
controller -> sensor
controller -> pump
#+END_SRC
#+RESULTS:
#+begin_example
┌─────────┐┌──────────┐
│pot_drain││controller│
└┬────────┘└┬┬────────┘
┌▽────────┐ ││         
│container│ ││         
└───┬────┬┘ ││         
    │    │ ┌│┘         
   ┌│────│─│┘          
┌──▽▽┐┌──▽─▽─┐         
│pump││sensor│         
└┬───┘└──────┘         
┌▽─────────┐           
│main_drain│           
└──────────┘           

#+end_example



